Lab_original/Lab03-postProcessing/centrifugalPump-snappy/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    impeller
    {
        type            rotatingWallVelocity;
        origin          (0 0 0);
        axis            (0 0 1);
        omega           -100;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            pressureInletVelocity;
        value           uniform (0 0 0);
    }
    inletPipe
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            fixedValue;
        value           uniform (-0.2 0 0);
    }
    pumpCase
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    topBottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
