Lab_original/Lab03-postProcessing/centrifugalPump-snappy/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    impeller
    {
        type            zeroGradient;
    }
    inlet
    {
        type            totalPressure;
        rho             none;
        psi             none;
        gamma           1.4;
        p0              uniform 0;
        value           uniform 0;
    }
    inletPipe
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    pumpCase
    {
        type            zeroGradient;
    }
    topBottom
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
