Lab_original/Lab03-postProcessing/centrifugalPump-snappy/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.5;

boundaryField
{
    impeller
    {
        type            kqRWallFunction;
        value           uniform 1.5;
    }
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 1.5;
    }
    inletPipe
    {
        type            zeroGradient;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1.5;
        value           uniform 1.5;
    }
    pumpCase
    {
        type            kqRWallFunction;
        value           uniform 1.5;
    }
    topBottom
    {
        type            kqRWallFunction;
        value           uniform 1.5;
    }
}


// ************************************************************************* //
