Lab_original/Lab03-postProcessing/centrifugalPump-snappy/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 20;

boundaryField
{
    impeller
    {
        type            omegaWallFunction;
        value           uniform 20;
    }
    inlet
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.02;
        value           uniform 20;
    }
    inletPipe
    {
        type            omegaWallFunction;
        value           uniform 20;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 20;
        value           uniform 20;
    }
    pumpCase
    {
        type            omegaWallFunction;
        value           uniform 20;
    }
    topBottom
    {
        type            omegaWallFunction;
        value           uniform 20;
    }
}


// ************************************************************************* //
