Lab_original/Lab03-postProcessing/centrifugalPump-snappy/system/MRFProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


MRF1
{
    type MRFSource;
    active yes;
    selectionMode cellZone;
    cellZone movingCells;

    MRFSourceCoeffs
    {
        origin      (0 0 0);
        axis        (0 0 -1);
        omega       100; // rad/s
    }
}

